Процедура ДополнениеФормыОбъекта(Форма) Экспорт

	ИмяФормыОбъекта = Форма.ИмяФормы;
	
	Если ИмяФормыОбъекта = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуГруппаШапкаПраво(Форма); 
		
		//{{ДЗ 11.2 Задача2 Азизов И.И.
		ДобавитьПолеСогласованнаяСкидка(Форма);
		//}}
		
	ИначеЕсли  
		ИмяФормыОбъекта = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФорму(Форма);
	ИначеЕсли
		ИмяФормыОбъекта = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФорму(Форма);
	ИначеЕсли
		ИмяФормыОбъекта = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуГруппаШапкаПраво(Форма);
	ИначеЕсли
		ИмяФормыОбъекта = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуГруппаШапкаПраво(Форма);
	КонецЕсли;	
		   
	
КонецПроцедуры	   

Процедура ДобавитьПолеКонтактноеЛицоНаФормуГруппаШапкаПраво(Форма) 

	ПолеКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры	  

Процедура ВставитьПолеКонтактноеЛицоНаФорму(Форма) 

	ПолеКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры	

Процедура ДобавитьПолеСогласованнаяСкидка(Форма) 
	
	КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу"); 
	КомандаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу";
	КомандаПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Обновить;
	КомандаПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаПересчитатьТаблицу.Действие = "ДЗ_ПересчитатьТаблицу";
	
	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;

	ПолеСогласованнаяСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"),Форма.Элементы.ГруппаСкидка);
	ПолеСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСогласованнаяСкидка.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка"; 
	ПолеСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ДЗ_СогласованнаяСкидкаПриИзменении");
			
	КнопкаПересчитатьТаблицу = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка); 
    КнопкаПересчитатьТаблицу.ИмяКоманды = "ПересчитатьТаблицу";
	
КонецПроцедуры